{
  "model": "groq",
  "api_keys": {
    "gemini": "",
    "openai": "",
    "groq": ""
  },
  "chat_history": [
    {
      "question": "What are the steps involved in filing a lawsuit in India?",
      "chunks": [
        "Guide_to_Litigation_in_India.pdf (Chunk #9)",
        "Guide_to_Litigation_in_India.pdf (Chunk #10)",
        "Guide_to_Litigation_in_India.pdf (Chunk #8)"
      ],
      "summary": "Here is a summary of the legal information in clear, simple English:\n\n**Framing Issues**: After disclosure, the court consults with parties to identify issues to be determined in the suit.\n\n**Evidence**: \n- Oral testimony and witness evidence are given in an affidavit.\n- The counter-party has the right to cross-examine.\n\n**Hearing**: \n- The plaintiff usually starts.\n- Other parties reply in turn.\n- The party that started has the right to reply generally after all parties have stated their case.\n\n**Commercial Disputes**: \n- Cases with a specified value above INR 0.3 million must be filed before a Commercial Court or Commercial Division with relevant territorial jurisdiction.\n- The specified value may differ by state.\n\n**Pre-Action Conduct Requirements**: \n- For commercial suits, pre-institution mediation and settlement are mandatory before filing a suit.\n- Failure to do so may result in rejection of the suit.\n- However, this is not required if urgent interim relief is applied for.\n\n**Notice to Government Entities**: \n- For suits against the Government of India, a state, or a public officer, at least two months' written notice is required.\n\n**Suits Against Foreign States**: \n- The Indian Government's written consent is required before instituting proceedings.\n\n**Procedure**: \n- A suit is started by filing a plaint.\n- The plaintiff must file a list of all documents with the plaint.\n- The defendant must file a Written Statement within 30 days and no later than 120 days from the date of service of summons.\n---\nHere is a summary of the legal information in clear, simple English:\n\n**Filing a Written Statement**\n\n* A party has a right to file a written statement.\n* If this right is not used, it is considered \"forfeited\".\n\n**Inspection of Documents**\n\n* Both parties must complete inspecting each other's documents within 30 days of filing the written statement or response to a counterclaim, whichever is later.\n* The court can extend this time by up to 30 days.\n\n**Disclosure of Documents**\n\n* If a party deliberately fails to disclose relevant documents, they may face exemplary costs.\n\n**Affidavits of Admission and Denial**\n\n* Parties must file affidavits stating which documents they admit or deny within 15 days of completing inspection or another date set by the court.\n\n**Case Management Hearing**\n\n* A case management hearing must be held within 4 weeks of filing the affidavit of admission or denial.\n* At this hearing, the court may:\n\t+ Frame issues\n\t+ List witnesses\n\t+ Set dates for evidence and written arguments\n\t+ Set dates and time limits for oral arguments\n\n**Consequences of Non-Compliance**\n\n* If a party fails to comply with an order from the case management hearing, the court may:\n\t+ Levy costs\n\t+ Foreclose the party's right to file documents or conduct cross-examinations\n\t+ Dismiss the plaint or allow the suit\n\n**Written Arguments**\n\n* Parties must submit written arguments 4 weeks before oral arguments.\n* Revised written arguments can be submitted within 1 week of completing oral arguments.\n\n**Summary Suits**\n\n* A plaintiff can file a summary suit for monetary claims based on negotiable instruments or written contracts.\n* No relief other than a monetary decree can be claimed in a summary suit.\n\n**Summary Judgment**\n\n* A party can apply for a summary judgment after the writ of summons is served on the defendant but before framing issues.\n* The court can grant a summary judgment if:\n\t+ The plaintiff has no real prospect of succeeding\n\t+ The defendant has no real prospect of defending the claim\n\t+ There is no compelling reason to proceed with oral evidence\n\n**Class Actions**\n\n* Various Indian statutes, including the Companies Act and Consumer Protection Act, 2019, have codified the law on class actions.\n* The CPC provides for representative actions.\n\n**Summary Suits: Leave to Defend**\n\n* A defendant in a summary suit does not have a right to defend but can apply to the court for leave to defend.\n* The defendant must establish a prima facie defense to be granted leave to defend.\n---\nHere is a summary of the legal information in clear, simple English:\n\n**Suing a Foreign State**\n\n* The Indian Government's consent is required to sue a foreign state in an Indian court.\n* Consent can be given if:\n\t+ The foreign state has sued someone in an Indian court.\n\t+ The foreign state is trading or owns property in India.\n\t+ The foreign state has waived its immunity.\n* However, consent is not needed if a tenant sues a foreign state for property.\n\n**Executing a Decree against a Foreign State**\n\n* A decree against a foreign state cannot be enforced without the Indian Government's consent.\n\n**Suits by Foreign Entities**\n\n* A foreign entity can sue in an Indian court if it is an \"alien friend\" or an \"alien enemy\" residing in India with permission.\n* An \"alien enemy\" is someone from a country at war with India, but they need a license to do business in that country.\n* A foreign entity cannot sue if it is an \"alien enemy\" residing in India without permission or in a foreign country without a license.\n\n**Filing a Suit**\n\n* A suit is started by filing a plaint with the following information:\n\t+ Court name\n\t+ Names and addresses of parties\n\t+ Cause of action\n\t+ Jurisdiction\n\t+ Limitation period\n\t+ Relief claimed\n\t+ Value of the subject matter\n\t+ List of documents\n* The plaint must be verified by an affidavit.\n\n**Procedure**\n\n* The court issues a summons to the defendant, who must appear and file a written statement within 30-90 days.\n* Pleadings can be amended with the court's leave.\n* The court may order disclosure of documents and inspection. \n\n**Consequences of Non-Compliance**\n\n* A party who fails to comply with an order for discovery, inspection, or answering interrogatories may be non-suited or have their defense struck out."
    }
  ]
}
